<a href="https://colab.research.google.com/github/DarkAlexWang/ICME_Workshop_2023/blob/main/Day_1_SQLite_For_students.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src="https://icme.stanford.edu/sites/g/files/sbiybj17116/files/styles/medium/public/media/image/icme_logo_sans_shadow_and_su_unit_high_res_0.png?itok=lg7j02xq" alt="ICME" width="200">

# Activity 1: Exploring an SQL Database

<img src="https://allinone-academy.com/images/course/SQL_Academy.png" alt="SQL" width="200">


SQL Databases are probably one of the first ways we stored data, dating back to 1970s.

In this database, you have tables, and each table has columns and rows. Each row has one value for each of the columns.

## Theme: Storing tweets

<img src="https://akm-img-a-in.tosshub.com/indiatoday/images/story/202307/twitter-x_0-sixteen_nine.jpg?VersionId=oz9saFzaCFimfp.4ppl67uYj9yVzFW0K&size=690:388" alt="SQL" width="200">

**Social data** is one of the most important use cases of Big Data. In this database, we store a few amounts of tweets and users of Twitter.

**Each and everyone of you is present in this database**. We have generated the tweets randomly so they should only be fun or simple. We hope that there's nothing more than that üòá

======

Let's see how we can explore this database together, find our tweets, and answer some basic questions on those.

# Introduction to Google Colab!

![Google Colab](https://miro.medium.com/v2/resize:fit:500/1*pimj8lXWwZnqLs2xVCV2Aw.png)

Welcome to Google Colaboratory (Colab)!

Google Colab is an online workspace that allows you to write and execute Python code. It's similar to Jupyter Notebooks, if you're familiar with that tool.

Key features of Google Colab:

1. **No setup required**: Just open the tool in your browser and start coding.
2. **It's free!**: Colab is free, with free computing resources to run your code. It even gives access to graphical processing units (GPUs), which can be very useful if you're dealing with machine learning models.
3. **Easy sharing and collaboration**: You can easily share your Colab notebooks with others and even collaborate in real-time, much like a Google Doc.
"""

In [ ]:
# This is a code cell. You can write and execute Python code here.
# Let's try a simple print statement. Click the play button to run this cell.

print("Hello, world!")

print("1 + 1 =", 1+1)

Hello, world!
1 + 1 = 2

# Step 0: Setup our environment

Whenever working with data, we need to setup our environment. In this workshop, you won't need to do it, we'll just tell you what to do.

### Here, just run the following cell to make sure we connect properly to our database

In [ ]:
%%capture
# Install dependencies required
!pip install ipython-sql SQLAlchemy==1.4.4 boto3

# Import the necessary modules
import sqlite3
import os
import boto3

os.environ['AWS_ACCESS_KEY_ID'] = 'AKIATXWEDNNDSXTHEZHA'
os.environ['AWS_SECRET_ACCESS_KEY'] = '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'

s3 = boto3.client('s3')
s3.download_file('icme-sws-2023-big-data-bucket', 'my_database.db', 'my_database.db')

# Load SQL and load the database
%load_ext sql
%sql sqlite:///my_database.db

# Step 1: üß≠ Explore the data!

Now that we're connected to our SQL database, let's see how we can see what's in there.

The first thing to learn is the SQL syntax. It's always the same:

We *SELECT* something *FROM* a table. To select everything, we just use '*'.

So to see all our tweets:

In [ ]:
%%sql
SELECT * FROM tweets LIMIT 10;

 * sqlite:///my_database.db
Done.

[(0, 'dong', "Just finished reading a thought-provoking book on quantum physics. My brain feels like it's traveled to another dimension! üöÄ #ScienceNerd", '2023-07-25 00:28:35.156731', 592, 1012),
 (1, 'dong', "Had the most amazing cup of coffee this morning. ‚òï Can't beat the perfect balance of boldness and smoothness! #CoffeeLover", '2023-07-24 00:28:35.156758', 283, 789),
 (2, 'dong', 'Just saw the cutest puppy on my way to work! üê∂ It definitely made my day a whole lot better. #PuppyLove', '2023-07-23 00:28:35.156765', 976, 2531),
 (3, 'dong', 'The weekend is finally here! Time to unwind, catch up on Netflix, and forget about the stresses of the week. üéâ #WeekendVibes', '2023-07-22 00:28:35.156771', 742, 1897),
 (4, 'dong', "I've been learning how to play the guitar lately, and my fingers feel like they've been through a whirlwind. Definitely worth it though! üé∏ #Guitarist", '2023-07-21 00:28:35.156780', 175, 434),
 (5, 'dong', "The world is a beautiful place, full of so much diversity and wonder. Let's cherish and celebrate these differences, rather than letting them divide us. üåç #UnityInDiversity", '2023-07-20 00:28:35.156786', 2689, 6352),
 (6, 'dong', 'Just finished a challenging crossword puzzle in record time! Feeling like a true wordsmith right now. üòÑ #PuzzleMaster', '2023-07-19 00:28:35.156791', 79, 203),
 (7, 'dong', "Life is like a box of chocolates ‚Äì you never know what you're gonna get. üç´ Embrace the surprises and enjoy the sweetness! #LifeLessons", '2023-07-18 00:28:35.156796', 1232, 4209),
 (8, 'dong', "I found the key to happiness ‚Äì it's called pizza. üçï Who's with me on this one? #Foodie", '2023-07-17 00:28:35.156801', 436, 1152),
 (9, 'dong', "Sometimes it's the small things in life that bring the greatest joy ‚Äì like finding money in your jeans pocket or hearing your favorite song on the radio. #SimplePleasures", '2023-07-16 00:28:35.156806', 102, 311)]

By the way, apart from the "tweets" table, what else is in my database?

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///my_database.db
Done.

[('users',), ('tweets',)]

In [ ]:
%%sql
SELECT sql from sqlite_schema where name = "tweets";

 * sqlite:///my_database.db
Done.

[('CREATE TABLE tweets(\n    id INT PRIMARY KEY,\n    username VARCHAR(50),\n    tweet_text TEXT,\n    date_posted DATE,\n    retweets INT,\n    likes INT\n)',)]

# Step 2: Ask simple questions!

When using data, you first want to explore a bit by seeing what simple questions you can answer.

Maybe you're curious. After all, all of the workshop students are in this dataset!

## Filtering

Usually, we want to filter to see data obeying a condition. Here, to find tweets from a particular user.

To add a condition, we use *WHERE* and we add a condition:

In [ ]:
# What did "ng" post on Twitter? üëÄ

%%sql
SELECT * FROM tweets WHERE username = 'ng';

 * sqlite:///my_database.db
Done.

[(60, 'ng', 'Just finished reading a book about time travel and it was mind-bending! Can you imagine going back in time and witnessing historical events? üìö‚è∞', '2023-07-25 00:30:54.916827', 825, 4682),
 (61, 'ng', "The smell of freshly baked cookies is just heaven! There's something magical about taking them out of the oven and enjoying them with a glass of milk. üç™ü•õ", '2023-07-24 00:30:54.916858', 622, 3098),
 (62, 'ng', "Currently binge-watching my favorite TV series and it's getting intense! Can't wait to see how the plot unfolds. üì∫üí•", '2023-07-23 00:30:54.916871', 327, 1867),
 (63, 'ng', 'Just finished a challenging workout session at the gym. My muscles are begging for mercy! üí™üòÖ', '2023-07-22 00:30:54.916882', 143, 931),
 (64, 'ng', 'Exploring new places is always an adventure! Today, I stumbled upon a hidden gem of a coffee shop. Their cappuccino is divine! ‚òïÔ∏è‚ú®', '2023-07-21 00:30:54.916894', 462, 2356),
 (65, 'ng', "Watching the sunset by the beach... it's truly a breathtaking sight. Mother Nature never fails to amaze me. üåÖüåä", '2023-07-20 00:30:54.916904', 721, 3989),
 (66, 'ng', "The world needs more kindness and empathy. Let's spread love and understanding, one small act at a time. ‚ù§Ô∏èüåç", '2023-07-19 00:30:54.916913', 938, 5125),
 (67, 'ng', 'Just learned a new language phrase today. Time to impress my friends with my newfound linguistic skills! üí¨üåç', '2023-07-18 00:30:54.916922', 72, 423),
 (68, 'ng', "Sometimes, all you need is a good laugh to brighten your day. Here's a joke for you: What do you call a fish with no eyes? Fshhh! üòÑüêü", '2023-07-17 00:30:54.916932', 582, 2798),
 (69, 'ng', "Reflecting on past experiences, I'm reminded of the importance of resilience. Life may throw challenges our way, but we have the strength to overcome them. üí™‚ú®", '2023-07-16 00:30:54.916942', 201, 1219)]

In [ ]:
# Who is such a good influencer they have more than 10K followers?

%%sql
SELECT * FROM users WHERE followers_count > 10000;

 * sqlite:///my_database.db
Done.

[(3, 'caracciolisalinas', 'Pascal Caraccioli-Salinas', 1004256, 734),
 (5, 'kallepallirao', 'Venkat Laxminarayan Kallepalli Rao', 10394, 558),
 (7, 'foresta', 'Giorgia Foresta', 123456, 678),
 (14, 'contapay', 'Anastasia Contapay', 12345, 679),
 (23, 'blair', 'James Blair', 14938, 1147),
 (45, 'aguilarrivera', 'Marcelo Aguilar Rivera', 1234567, 789)]

In [ ]:
# What are the most popular tweets with more than 50K likes and 9K retweets?

%%sql
SELECT * FROM tweets WHERE retweets > 10000 AND likes > 50000 LIMIT 5;

 * sqlite:///my_database.db
Done.

[(170, 'martin', 'A big shoutout to all the essential workers who have been working tirelessly to keep us safe during these challenging times. We appreciate you! üëè', '2023-07-16 00:35:38.395300', 15678, 98765),
 (685, 'raj', 'Just spotted a shooting star! Made a wish, and now crossing my fingers for it to come true. ‚ú®üå†', '2023-07-13 00:55:52.461852', 18266, 81299),
 (804, 'alemamensah', "Just finished reading a mind-blowing book recommended by a friend. Can't wait to discuss it with fellow bookworms! #mustread", '2023-07-25 01:00:17.085090', 23665, 96562)]

## Pattern recognition

The *LIKE* keyword can be helpful to find patterns, in text for example!

In [ ]:
# Who likes to talk about books?

%%sql
SELECT * FROM tweets WHERE tweet_text LIKE '%books%';

 * sqlite:///my_database.db
Done.

[(188, 'collins', 'Just discovered a hidden gem of a bookstore. Bookworm heaven! üìñ #BookLover', '2023-07-13 00:36:39.386859', 634, 2093),
 (243, 'khaja', "Seriously considering starting a support group for people addicted to buying books. It's an endless cycle of joy and guilt! üìöüí∏", '2023-07-22 00:38:27.212475', 32, 207),
 (606, 'li', 'Just stumbled upon a hidden gem of a bookstore. Spent hours lost in the aisles, surrounded by the smell of old books. Heaven for bookworms like me! üìñ', '2023-07-18 00:54:04.284523', 712, 2853),
 (650, 'aguilarrivera', 'Life is all about finding joy in the little things. My happy place? A cozy bookstore with a hot cup of coffee. ‚òïüìö #BookLover', '2023-07-18 00:55:10.124549', 73, 582),
 (691, 'kupu', 'Spent the afternoon exploring a hidden gem of a bookstore. Found some amazing vintage novels üìö‚ú® #booklover', '2023-07-22 00:56:15.845788', 79, 442),
 (714, 'pineda', 'Books have a way of transporting us to magical worlds. Any recommendations? üìö #bookworm', '2023-07-24 00:57:17.752904', 276, 899),
 (741, 'hill', "Just finished reading the most captivating thriller novel. Couldn't put it down! Any recommendations for the next page-turner? #reading #books", '2023-07-24 00:58:25.360365', 182, 621)]

## Sorting

Sometimes we need the highest values first, or lowest.

*ORDER BY* and *ASC* or *DESC* can be useful for that.

In [ ]:
# Who posted the first tweet?

%%sql
SELECT * FROM tweets ORDER BY date_posted ASC LIMIT 10;

In [ ]:
# Who are the 5 most followed students ? üîù

%%sql
SELECT * FROM users ORDER BY followers_count DESC LIMIT 5;

## Joining data

Joining data is a key feature of databases. Here we can join two tables to get all the information from both properly "stitched together", and get the most popular tweet and the user who posted it

‚ùì What is the most popular tweet?

In [ ]:
%%sql
SELECT * FROM tweets JOIN users ON tweets.username = users.username ORDER BY  tweets.likes DESC LIMIT 1;

 * sqlite:///my_database.db
Done.

[(170, 'martin', 'A big shoutout to all the essential workers who have been working tirelessly to keep us safe during these challenging times. We appreciate you! üëè', '2023-07-16 00:35:38.395300', 15678, 98765, 12, 'martin', 'Mireya Martin', 753, 2471)]

That's a **lot** of columns. We can actually select less columns by simply SELECT-ing the ones we want in the command:

In [ ]:
%%sql
SELECT tweets.id, users.full_name, tweets.tweet_text, tweets.likes FROM tweets JOIN users ON tweets.username = users.username ORDER BY  tweets.likes DESC LIMIT 1;

 * sqlite:///my_database.db
Done.

[(170, 'Mireya Martin', 'A big shoutout to all the essential workers who have been working tirelessly to keep us safe during these challenging times. We appreciate you! üëè', 98765)]

## ‚äï Performing operations on the data

We can run some interesting operations in SQL to explore a bit further!

We can use for example:
- COUNT to count the amount of different values for a column.
- SUM to sum over a column
- AVG to average a column.

‚ùì Question: How many tweets has "ng" produced?

In [ ]:
%%sql
SELECT COUNT(id) FROM tweets WHERE tweets.username = "ng";

 * sqlite:///my_database.db
Done.

[(10,)]

‚ùì Question: What's the average amount of retweets in our database?

In [ ]:
%%sql
SELECT AVG(retweets) FROM tweets;

 * sqlite:///my_database.db
Done.

[(732.5726405090138,)]

In [ ]:
# We can make VERY complex requests

%%sql
SELECT username, AVG(retweets) FROM tweets GROUP BY username ORDER BY AVG(retweets) DESC LIMIT 10;

# Step 3: üëâ Your turn!

Two questions:

‚ùì Who are the 10 users with the fewest followers?

In [ ]:
%%sql
# YOUR REQUEST HERE

‚ùì Who are the top 10 users with the highest average number of likes per tweet?

In [ ]:
%%sql
# YOUR REQUEST HERE